000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.        ABNDIMS.
000300 AUTHOR.            PMIPJA0.
000400 DATE-WRITTEN.      DEC 2015.
000500 s s s s s
000600********************************************************
000700*  DESCRIPTION: BATCH PROGRAM TO FORCE AN ABEND S0C7 TO
000800*               TEST ABEND-AID IMS INTERFACE TO FILE-AID
000900********************************************************
001000 ENVIRONMENT DIVISION.
001100 CONFIGURATION SECTION.
001200 SOURCE-COMPUTER.                IBM-ZSERIES.
001300 OBJECT-COMPUTER.                IBM-ZSERIES.
001400*
001500 INPUT-OUTPUT SECTION.
001600********************************************************
001700*             DATA DIVISION
001800********************************************************
001900 DATA DIVISION.
002000********************************************************
002100*             WORKING STORAGE SECTION
002200********************************************************
002300 WORKING-STORAGE SECTION.
002400 01  CONSTANTS.
002500     05 C-YES                   PIC X(01) VALUE 'Y'.
002600     05 C-NO                    PIC X(01) VALUE 'N'.
002700     05 C-NO-INPUT              PIC X(80)
002800      VALUE 'NO INPUT TO PROCESS!!!!'.
002900 01  SWITCHES.
003000     05 S-EOF                   PIC X(01) VALUE 'N'.
003100        88 EOF                            VALUE 'Y'.
003200 01  ACCUMULATORS.
003300     05 A-REC-CNT               PIC 9(06) VALUE ZEROES.
003400     05 A-CNT                   PIC 9(06) VALUE ZEROES.
003500***** DEPPART ROOT
003600 COPY PART010.
003700***** DEPPART CHILD
003800 COPY PART020.
003900*
004000 01  FUNCTION-CODES.
004100     05 GN-FUNC   PIC X(4) VALUE 'GN'.
004200     05 GU-FUNC   PIC X(4) VALUE 'GU'.
004300     05 GHU-FUNC  PIC X(4) VALUE 'GHU'.
004400     05 GNP-FUNC  PIC X(4) VALUE 'GNP'.
004500     05 GNHP-FUNC PIC X(4) VALUE 'GNHP'.
004600     05 DLET-FUNC PIC X(4) VALUE 'DLET'.
004700     05 ROLB-FUNC PIC X(4) VALUE 'ROLB'.
004800     05 ISRT-FUNC PIC X(4) VALUE 'ISRT'.
004900*
005000  01 DEPPART-SSA-UNQUAL.
005100     05 FILLER    PIC X(08) VALUE 'PART010 '.
005200     05 FILLER    PIC X     VALUE SPACES.
005300*
005400 01  W-MISC-ITEMS.
005500     05 W-MISC-ONE               PIC 9(04).
005600     05 W-MISC-TWO               PIC X(04).
005700     05 W-MISC-TWO-NUM REDEFINES
005800        W-MISC-TWO               PIC 9(04).
005900*
006000 01  USER-ABEND-CODE            PIC S9999 COMP.
006100 01  ABEND-MODULE               PIC X(30) VALUE 'ILBOABN0'.
006200*
006300 LINKAGE SECTION.
006400 01 IO-PCB.
006500     05 FILLER                PIC X(10).
006600     05 IO-PCB-STATUS         PIC XX.
006700 01 DEPPART-PCB.
006800     05 DBD-NAME              PIC X(8).
006900     05 SEG-LEVEL             PIC X(2).
007000     05 DATABASE-STATUS       PIC X(2).
007100     05 PROC-OPTIONS          PIC X(4).
007200     05 RESERVED              PIC S9(5) COMP.
007300     05 SEGMENT-NAME-FEEDBACK PIC X(8).
007400     05 LENGTH-KEY-FEEDBACK   PIC S9(5) COMP.
007500     05 NUM-SENS-SEGS         PIC S9(5) COMP.
007600     05 KEY-FEEDBACK          PIC X(6).
007700*
007800 PROCEDURE DIVISION USING
007900                    IO-PCB
008000                    DEPPART-PCB.
008100
008200 0000-INIT.
008300     MOVE C-NO   TO S-EOF
008400     MOVE ZEROES TO ACCUMULATORS
008500     PERFORM 2000-MAIN
008600     GOBACK
008700     .
008800
008900 2000-MAIN.
009000     PERFORM 5000-GN-DEPPART
009100     MOVE EFFECTIVITY-DATE  TO W-MISC-TWO
009200     COMPUTE W-MISC-ONE = W-MISC-TWO-NUM - 1
009300     .
009400
009500 5000-GN-DEPPART.
009600     CALL 'CBLTDLI' USING
009700                    GN-FUNC
009800                    DEPPART-PCB
009900                    PART-ROOT-DATA
010000                    DEPPART-SSA-UNQUAL
010010
010100     EVALUATE DATABASE-STATUS
010200       WHEN ' '
010300         CONTINUE
010400       WHEN OTHER
010500         PERFORM 9999-ABEND
010600     END-EVALUATE
010700     .
010800 9999-ABEND.
010900     DISPLAY IO-PCB
011000     MOVE 12 TO USER-ABEND-CODE
011100     CALL ABEND-MODULE USING USER-ABEND-CODE
011200     .
011300