       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
      * SIMPLE HELLO WORLD PROGRAM
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD!'.
           STOP RUN.