000100*01  CIFU032-PARAMETERS.                                          00010001
000300     02  CIFU032-WITHHOLD-PERCENT PIC SV99999  COMP-3.            00030001
000300     02  FILLER                   PIC X(47).                      00031002