000100*01  SPEC-FORMS-CTL.                                              00010000
000200     02  SF-REPORT-CODE      PIC S999                    COMP-3.  00020000
000300     02  SF-FILE-ID          PIC XXX.                             00030000
000400     02  SF-BANK-NO          PIC 99.                              00040000
000500     02  SF-ACCT-ID          PIC 999                     COMP-3.  00050000
000600     02  SF-ACCT-NO          PIC 9(9)                    COMP-3.  00060000
000700     02  SF-CURR-PROC-DT     PIC S9(7)                   COMP-3.  00070001
000800     02  FILLER              PIC X(132).                          00080001
000900*  THIS LAYOUT IS USED FOR THE SPECIAL FORMS REPORT FILE CTL REC. 00090000
001000*  THIS RECORD IS 150 CHARACTERS.                                 00100000